---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewFixedSketchPlane
source: html/817228c9-ef47-b375-cc7e-43929a083e8d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewFixedSketchPlane Property

"None"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewFixedSketchPlane { get; }
```